uLipe/espFoC/source/drivers/inverter/esp32s3/esp_foc_inverter_mcpwm_6pwm.c
/*
 * MIT License
 *
 * Copyright (c) 2021 Felipe Neves
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#include <string.h>
#include "sdkconfig.h"
#include "driver_q16_local.h"
#include "esp_foc_inverter_mcpwm_6pwm.h"
#include "espFoC/drivers/esp_foc_inverter.h"
#include "driver/mcpwm_prelude.h"
#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "soc/soc_caps.h"

#if SOC_ETM_SUPPORTED
#include "esp_foc_inverter_mcpwm_etm.h"
#endif

/*
 * Notes:
 * - Mirrors inverter_3pwm_mcpwm.c but creates two generators per phase.
 */

typedef struct {
    int enable_gpio;
    int enable_inverted;

    mcpwm_timer_handle_t timer;
    mcpwm_oper_handle_t operators[3];
    mcpwm_cmpr_handle_t comparators[3];

    mcpwm_gen_handle_t gen_high[3];
    mcpwm_gen_handle_t gen_low[3];

    float dc_link_voltage_nominal;
    q16_t dc_link_q16;

    esp_foc_inverter_callback_t notifier;
    void *arg;

#if SOC_ETM_SUPPORTED
    inverter_mcpwm_etm_t etm;
#endif

    esp_foc_inverter_t interface;
} esp_foc_mcpwm6_inverter_t;

#define MCPWM_RATE_HZ         CONFIG_ESP_FOC_PWM_RATE_HZ
#define MCPWM_RESOLUTION_HZ   160000000
#define MCPWM_PERIOD_TOP      (MCPWM_RESOLUTION_HZ / MCPWM_RATE_HZ)
#define MCPWM_PERIOD_TOP_HALF (MCPWM_PERIOD_TOP / 2)
#define MCPWM_DEADTIME_NS     20

static esp_foc_mcpwm6_inverter_t mcpwm6s[CONFIG_NOOF_AXIS];

static mcpwm_timer_config_t timer_config = {
    .group_id = 0,
    .clk_src = MCPWM_TIMER_CLK_SRC_DEFAULT,
    .resolution_hz = MCPWM_RESOLUTION_HZ,
    .count_mode = MCPWM_TIMER_COUNT_MODE_UP_DOWN,
    .period_ticks = MCPWM_PERIOD_TOP,
};

static mcpwm_operator_config_t operator_config = {
    .flags.update_gen_action_on_tep = true,
    .flags.update_gen_action_on_tez = true,
    .group_id = 0,
};

static mcpwm_comparator_config_t compare_config = {
    .flags.update_cmp_on_tez = true,
};

static const char *TAG = "INVERTER_MCPWM6";

static inline uint32_t deadtime_ns_to_ticks(uint32_t ns)
{
    /* resolution_hz is in Hz -> ticks per second */
    /* ticks = us * resolution_hz / 1_000_000 */
    return (uint32_t)(((uint64_t)ns * (uint64_t)MCPWM_RESOLUTION_HZ) / 1000000000ULL);
}

static bool inverter_isr(mcpwm_timer_handle_t timer,
                        const mcpwm_timer_event_data_t *edata,
                        void *user_data)
{
    (void)timer;
    (void)edata;

    esp_foc_mcpwm6_inverter_t *inverter = (esp_foc_mcpwm6_inverter_t *)user_data;

    if (inverter->notifier) {
        inverter->notifier(inverter->arg);
    }
    return false;
}

static q16_t dc_link_q16_from_nominal(float nominal_volts)
{
    float v = nominal_volts;
    if (v <= 0.0f) {
        v = (float)CONFIG_ESP_FOC_DC_LINK_NOMINAL_MV / 1000.0f;
    }
    if (v < 1e-6f) {
        v = 1.0f;
    }
    return q16_from_float(v);
}

static q16_t get_dc_link_voltage(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm6_inverter_t *obj =
        __containerof(self, esp_foc_mcpwm6_inverter_t, interface);
    return obj->dc_link_q16;
}

static void set_duties(esp_foc_inverter_t *self, q16_t duty_a, q16_t duty_b, q16_t duty_c)
{
    esp_foc_mcpwm6_inverter_t *obj = __containerof(self, esp_foc_mcpwm6_inverter_t, interface);
    uint32_t ph = (uint32_t)MCPWM_PERIOD_TOP_HALF;

    mcpwm_comparator_set_compare_value(
        obj->comparators[0], (uint16_t)esp_foc_q16_duty_ticks(duty_a, ph));
    mcpwm_comparator_set_compare_value(
        obj->comparators[1], (uint16_t)esp_foc_q16_duty_ticks(duty_b, ph));
    mcpwm_comparator_set_compare_value(
        obj->comparators[2], (uint16_t)esp_foc_q16_duty_ticks(duty_c, ph));
}

static void set_inverter_callback(esp_foc_inverter_t *self,
                                esp_foc_inverter_callback_t callback,
                                void *argument)
{
    esp_foc_mcpwm6_inverter_t *obj = __containerof(self, esp_foc_mcpwm6_inverter_t, interface);
    obj->notifier = callback;
    obj->arg = argument;
}

static uint32_t get_inverter_pwm_rate(esp_foc_inverter_t *self)
{
    (void)self;
    return (uint32_t)MCPWM_RATE_HZ;
}

static void inverter_enable(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm6_inverter_t *obj = __containerof(self, esp_foc_mcpwm6_inverter_t, interface);
    if (obj->enable_gpio >= 0) {
        gpio_set_level(obj->enable_gpio, obj->enable_inverted ? false : true);
    }
}

static void inverter_disable(esp_foc_inverter_t *self)
{
    esp_foc_mcpwm6_inverter_t *obj = __containerof(self, esp_foc_mcpwm6_inverter_t, interface);
    if (obj->enable_gpio >= 0) {
        gpio_set_level(obj->enable_gpio, obj->enable_inverted ? true : false);
    }
}

esp_foc_inverter_t *inverter_6pwm_mpcwm_new(int gpio_u_high, int gpio_u_low,
                                           int gpio_v_high, int gpio_v_low,
                                           int gpio_w_high, int gpio_w_low,
                                           int gpio_enable,
                                           float dc_link_voltage,
                                           int port)
{
    if (port < 0 || port >= CONFIG_NOOF_AXIS) {
        ESP_LOGE(TAG, "Invalid port %d (CONFIG_NOOF_AXIS=%d)", port, CONFIG_NOOF_AXIS);
        return NULL;
    }

    esp_foc_mcpwm6_inverter_t *obj = &mcpwm6s[port];
    memset(obj, 0, sizeof(*obj));

    if (gpio_enable == -1) {
        /* No enable output (MOSFET drivers always enabled or not wired to MCU). */
        obj->enable_gpio = -1;
        obj->enable_inverted = 0;
    } else if (gpio_enable < -1) {
        /* e.g. -8 -> GPIO8, active low (inverted) */
        obj->enable_gpio = -gpio_enable;
        obj->enable_inverted = 1;
    } else {
        /* >= 0: pin gpio_enable, active high */
        obj->enable_gpio = gpio_enable;
        obj->enable_inverted = 0;
    }
    obj->dc_link_voltage_nominal = dc_link_voltage;
    obj->dc_link_q16 = dc_link_q16_from_nominal(dc_link_voltage);
    obj->interface.get_dc_link_voltage = get_dc_link_voltage;
    obj->interface.set_duties = set_duties;
    obj->interface.set_inverter_callback = set_inverter_callback;
    obj->interface.get_inverter_pwm_rate = get_inverter_pwm_rate;
    obj->interface.enable = inverter_enable;
    obj->interface.disable = inverter_disable;
    obj->notifier = NULL;
    obj->arg = NULL;

    if (obj->enable_gpio >= 0) {
        gpio_config_t io_conf = {
            .pin_bit_mask = 1ULL << obj->enable_gpio,
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = 0,
            .pull_down_en = 0,
            .intr_type = GPIO_INTR_DISABLE,
        };
        gpio_config(&io_conf);
        gpio_set_level(obj->enable_gpio, obj->enable_inverted ? true : false);
    }

    /* Create MCPWM timer/operator/comparator resources in selected group (port). */
    timer_config.group_id = port;
    mcpwm_new_timer(&timer_config, &obj->timer);

    operator_config.group_id = port;
    for (int i = 0; i < 3; i++) {
        mcpwm_new_operator(&operator_config, &obj->operators[i]);
        mcpwm_operator_connect_timer(obj->operators[i], obj->timer);
    }

    for (int i = 0; i < 3; i++) {
        mcpwm_new_comparator(obj->operators[i], &compare_config, &obj->comparators[i]);
        mcpwm_comparator_set_compare_value(obj->comparators[i], 0);
    }

    /* Create generators: two per phase (high/low). */
    mcpwm_generator_config_t gen_config = {};

    gen_config.gen_gpio_num = gpio_u_high;
    mcpwm_new_generator(obj->operators[0], &gen_config, &obj->gen_high[0]);
    gen_config.gen_gpio_num = gpio_u_low;
    mcpwm_new_generator(obj->operators[0], &gen_config, &obj->gen_low[0]);

    gen_config.gen_gpio_num = gpio_v_high;
    mcpwm_new_generator(obj->operators[1], &gen_config, &obj->gen_high[1]);
    gen_config.gen_gpio_num = gpio_v_low;
    mcpwm_new_generator(obj->operators[1], &gen_config, &obj->gen_low[1]);

    gen_config.gen_gpio_num = gpio_w_high;
    mcpwm_new_generator(obj->operators[2], &gen_config, &obj->gen_high[2]);
    gen_config.gen_gpio_num = gpio_w_low;
    mcpwm_new_generator(obj->operators[2], &gen_config, &obj->gen_low[2]);

    /* Generator actions:
     * High-side (same as inverter_3pwm_mcpwm):
     *  - on UP compare:  set LOW
     *  - on DOWN compare:set HIGH
     *
     * Low-side: complementary (inverted):
     *  - on UP compare:  set HIGH
     *  - on DOWN compare:set LOW
     */
    for (int i = 0; i < 3; i++) {
        mcpwm_generator_set_actions_on_compare_event(obj->gen_high[i],
            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_UP, obj->comparators[i], MCPWM_GEN_ACTION_LOW),
            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_DOWN, obj->comparators[i], MCPWM_GEN_ACTION_HIGH),
            MCPWM_GEN_COMPARE_EVENT_ACTION_END());

        mcpwm_generator_set_actions_on_compare_event(obj->gen_low[i],
            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_UP, obj->comparators[i], MCPWM_GEN_ACTION_LOW),
            MCPWM_GEN_COMPARE_EVENT_ACTION(MCPWM_TIMER_DIRECTION_DOWN, obj->comparators[i], MCPWM_GEN_ACTION_HIGH),
            MCPWM_GEN_COMPARE_EVENT_ACTION_END());
    }

    /* Dead-time insertion (conservative: 1us).
     * IMPORTANT: This assumes gen_high/gen_low are complementary pairs.
     */
    const uint32_t dt_ticks = deadtime_ns_to_ticks(MCPWM_DEADTIME_NS);
    mcpwm_dead_time_config_t dt_cfg = {
        .posedge_delay_ticks = dt_ticks,
        .negedge_delay_ticks = 0,
        .flags.invert_output = false,
    };

    for (int i = 0; i < 3; i++) {
        esp_err_t err = mcpwm_generator_set_dead_time(obj->gen_high[i], obj->gen_high[i], &dt_cfg);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Dead-time config failed on phase %d (err=%d). Continuing without dead-time.", i, (int)err);
        }
    }

    dt_cfg.posedge_delay_ticks = 0;
    dt_cfg.negedge_delay_ticks = dt_ticks;
    dt_cfg.flags.invert_output = true;

    for (int i = 0; i < 3; i++) {
        esp_err_t err = mcpwm_generator_set_dead_time(obj->gen_low[i], obj->gen_low[i], &dt_cfg);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Dead-time config failed on phase %d (err=%d). Continuing without dead-time.", i, (int)err);
        }
    }

#if SOC_ETM_SUPPORTED
    if (inverter_mcpwm_etm_init(&obj->etm, obj->operators[0], (uint32_t)MCPWM_PERIOD_TOP) == ESP_OK) {
        inverter_mcpwm_etm_register(&obj->interface, &obj->etm);
    } else {
        ESP_LOGW(TAG, "MCPWM ETM trigger init failed");
    }
#endif

    mcpwm_timer_event_callbacks_t driver_cb = {
        .on_full = inverter_isr,
    };
    mcpwm_timer_register_event_callbacks(obj->timer, &driver_cb, obj);
    mcpwm_timer_enable(obj->timer);
    mcpwm_timer_start_stop(obj->timer, MCPWM_TIMER_START_NO_STOP);

    ESP_LOGI(TAG, "6PWM MCPWM inverter ready, instance %p (port=%d)", &obj->interface, port);
    return &obj->interface;
}
